keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_CH_RCRB_Bits.VBS4 */
#define IFX_PSI5_CH_RCRB_VBS4_OFF (19)

/** \\brief  Length for Ifx_PSI5_CH_RCRB_Bits.VBS5 */
#define IFX_PSI5_CH_RCRB_VBS5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_RCRB_Bits.VBS5 */
#define IFX_PSI5_CH_RCRB_VBS5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_RCRB_Bits.VBS5 */
#define IFX_PSI5_CH_RCRB_VBS5_OFF (23)

/** \\brief  Length for Ifx_PSI5_CH_RCRC_Bits.BRS */
#define IFX_PSI5_CH_RCRC_BRS_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_RCRC_Bits.BRS */
#define IFX_PSI5_CH_RCRC_BRS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_RCRC_Bits.BRS */
#define IFX_PSI5_CH_RCRC_BRS_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_RCRC_Bits.TSF */
#define IFX_PSI5_CH_RCRC_TSF_LEN (2)

/** \\brief  Mask for Ifx_PSI5_CH_RCRC_Bits.TSF */
#define IFX_PSI5_CH_RCRC_TSF_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5_CH_RCRC_Bits.TSF */
#define IFX_PSI5_CH_RCRC_TSF_OFF (3)

/** \\brief  Length for Ifx_PSI5_CH_RCRC_Bits.TSP */
#define IFX_PSI5_CH_RCRC_TSP_LEN (2)

/** \\brief  Mask for Ifx_PSI5_CH_RCRC_Bits.TSP */
#define IFX_PSI5_CH_RCRC_TSP_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5_CH_RCRC_Bits.TSP */
#define IFX_PSI5_CH_RCRC_TSP_OFF (1)

/** \\brief  Length for Ifx_PSI5_CH_RCRC_Bits.TSR */
#define IFX_PSI5_CH_RCRC_TSR_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_RCRC_Bits.TSR */
#define IFX_PSI5_CH_RCRC_TSR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_RCRC_Bits.TSR */
#define IFX_PSI5_CH_RCRC_TSR_OFF (5)

/** \\brief  Length for Ifx_PSI5_CH_RDRH_Bits.MEI */
#define IFX_PSI5_CH_RDRH_MEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_RDRH_Bits.MEI */
#define IFX_PSI5_CH_RDRH_MEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_RDRH_Bits.MEI */
#define IFX_PSI5_CH_RDRH_MEI_OFF (29)

/** \\brief  Length for Ifx_PSI5_CH_RDRH_Bits.NBI */
#define IFX_PSI5_CH_RDRH_NBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_RDRH_Bits.NBI */
#define IFX_PSI5_CH_RDRH_NBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_RDRH_Bits.NBI */
#define IFX_PSI5_CH_RDRH_NBI_OFF (28)

/** \\brief  Length for Ifx_PSI5_CH_RDRH_Bits.NFI */
#define IFX_PSI5_CH_RDRH_NFI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_RDRH_Bits.NFI */
#define IFX_PSI5_CH_RDRH_NFI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_RDRH_Bits.NFI */
#define IFX_PSI5_CH_RDRH_NFI_OFF (30)

/** \\brief  Length for Ifx_PSI5_CH_RDRH_Bits.RBI */
#define IFX_PSI5_CH_RDRH_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_RDRH_Bits.RBI */
#define IFX_PSI5_CH_RDRH_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_RDRH_Bits.RBI */
#define IFX_PSI5_CH_RDRH_RBI_OFF (31)

/** \\brief  Length for Ifx_PSI5_CH_RDRH_Bits.SC */
#define IFX_PSI5_CH_RDRH_SC_LEN (3)

/** \\brief  Mask for Ifx_PSI5_CH_RDRH_Bits.SC */
#define IFX_PSI5_CH_RDRH_SC_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5_CH_RDRH_Bits.SC */
#define IFX_PSI5_CH_RDRH_SC_OFF (24)

/** \\brief  Length for Ifx_PSI5_CH_RDRH_Bits.TEI */
#define IFX_PSI5_CH_RDRH_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_RDRH_Bits.TEI */
#define IFX_PSI5_CH_RDRH_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_RDRH_Bits.TEI */
#define IFX_PSI5_CH_RDRH_TEI_OFF (27)

/** \\brief  Length for Ifx_PSI5_CH_RDRH_Bits.TS */
#define IFX_PSI5_CH_RDRH_TS_LEN (24)

/** \\brief  Mask for Ifx_PSI5_CH_RDRH_Bits.TS */
#define IFX_PSI5_CH_RDRH_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5_CH_RDRH_Bits.TS */
#define IFX_PSI5_CH_RDRH_TS_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_RDRL_Bits.CRC */
#define IFX_PSI5_CH_RDRL_CRC_LEN (3)

/** \\brief  Mask for Ifx_PSI5_CH_RDRL_Bits.CRC */
#define IFX_PSI5_CH_RDRL_CRC_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5_CH_RDRL_Bits.CRC */
#define IFX_PSI5_CH_RDRL_CRC_OFF (1)

/** \\brief  Length for Ifx_PSI5_CH_RDRL_Bits.CRCI */
#define IFX_PSI5_CH_RDRL_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_RDRL_Bits.CRCI */
#define IFX_PSI5_CH_RDRL_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_RDRL_Bits.CRCI */
#define IFX_PSI5_CH_RDRL_CRCI_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_RDRL_Bits.RD */
#define IFX_PSI5_CH_RDRL_RD_LEN (28)

/** \\brief  Mask for Ifx_PSI5_CH_RDRL_Bits.RD */
#define IFX_PSI5_CH_RDRL_RD_MSK (0xfffffff)

/** \\brief  Offset for Ifx_PSI5_CH_RDRL_Bits.RD */
#define IFX_PSI5_CH_RDRL_RD_OFF (4)

/** \\brief  Length for Ifx_PSI5_CH_RSR_Bits.CRC */
#define IFX_PSI5_CH_RSR_CRC_LEN (3)

/** \\brief  Mask for Ifx_PSI5_CH_RSR_Bits.CRC */
#define IFX_PSI5_CH_RSR_CRC_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5_CH_RSR_Bits.CRC */
#define IFX_PSI5_CH_RSR_CRC_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_RSR_Bits.MSG */
#define IFX_PSI5_CH_RSR_MSG_LEN (2)

/** \\brief  Mask for Ifx_PSI5_CH_RSR_Bits.MSG */
#define IFX_PSI5_CH_RSR_MSG_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5_CH_RSR_Bits.MSG */
#define IFX_PSI5_CH_RSR_MSG_OFF (8)

/** \\brief  Length for Ifx_PSI5_CH_SCR_Bits.BSC */
#define IFX_PSI5_CH_SCR_BSC_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SCR_Bits.BSC */
#define IFX_PSI5_CH_SCR_BSC_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SCR_Bits.BSC */
#define IFX_PSI5_CH_SCR_BSC_OFF (7)

/** \\brief  Length for Ifx_PSI5_CH_SCR_Bits.CRC */
#define IFX_PSI5_CH_SCR_CRC_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SCR_Bits.CRC */
#define IFX_PSI5_CH_SCR_CRC_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SCR_Bits.CRC */
#define IFX_PSI5_CH_SCR_CRC_OFF (22)

/** \\brief  Length for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SCR_Bits.EPS */
#define IFX_PSI5_CH_SCR_EPS_OFF (6)

/** \\brief  Length for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SCR_Bits.FLUO */
#define IFX_PSI5_CH_SCR_FLUO_OFF (15)

/** \\brief  Length for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SCR_Bits.FLUS */
#define IFX_PSI5_CH_SCR_FLUS_OFF (14)

/** \\brief  Length for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_MSK (0x1)

