keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD30 */
#define IFX_PSI5_CH_SDRL_SD30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD30 */
#define IFX_PSI5_CH_SDRL_SD30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD30 */
#define IFX_PSI5_CH_SDRL_SD30_OFF (30)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD31 */
#define IFX_PSI5_CH_SDRL_SD31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD31 */
#define IFX_PSI5_CH_SDRL_SD31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD31 */
#define IFX_PSI5_CH_SDRL_SD31_OFF (31)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD3 */
#define IFX_PSI5_CH_SDRL_SD3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD3 */
#define IFX_PSI5_CH_SDRL_SD3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD3 */
#define IFX_PSI5_CH_SDRL_SD3_OFF (3)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD4 */
#define IFX_PSI5_CH_SDRL_SD4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD4 */
#define IFX_PSI5_CH_SDRL_SD4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD4 */
#define IFX_PSI5_CH_SDRL_SD4_OFF (4)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD5 */
#define IFX_PSI5_CH_SDRL_SD5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD5 */
#define IFX_PSI5_CH_SDRL_SD5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD5 */
#define IFX_PSI5_CH_SDRL_SD5_OFF (5)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD6 */
#define IFX_PSI5_CH_SDRL_SD6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD6 */
#define IFX_PSI5_CH_SDRL_SD6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD6 */
#define IFX_PSI5_CH_SDRL_SD6_OFF (6)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD7 */
#define IFX_PSI5_CH_SDRL_SD7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD7 */
#define IFX_PSI5_CH_SDRL_SD7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD7 */
#define IFX_PSI5_CH_SDRL_SD7_OFF (7)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD8 */
#define IFX_PSI5_CH_SDRL_SD8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD8 */
#define IFX_PSI5_CH_SDRL_SD8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD8 */
#define IFX_PSI5_CH_SDRL_SD8_OFF (8)

/** \\brief  Length for Ifx_PSI5_CH_SDRL_Bits.SD9 */
#define IFX_PSI5_CH_SDRL_SD9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDRL_Bits.SD9 */
#define IFX_PSI5_CH_SDRL_SD9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDRL_Bits.SD9 */
#define IFX_PSI5_CH_SDRL_SD9_OFF (9)

/** \\brief  Length for Ifx_PSI5_CH_SDS_Bits.CON */
#define IFX_PSI5_CH_SDS_CON_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDS_Bits.CON */
#define IFX_PSI5_CH_SDS_CON_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDS_Bits.CON */
#define IFX_PSI5_CH_SDS_CON_OFF (31)

/** \\brief  Length for Ifx_PSI5_CH_SDS_Bits.MID */
#define IFX_PSI5_CH_SDS_MID_LEN (8)

/** \\brief  Mask for Ifx_PSI5_CH_SDS_Bits.MID */
#define IFX_PSI5_CH_SDS_MID_MSK (0xff)

/** \\brief  Offset for Ifx_PSI5_CH_SDS_Bits.MID */
#define IFX_PSI5_CH_SDS_MID_OFF (16)

/** \\brief  Length for Ifx_PSI5_CH_SDS_Bits.SCRC */
#define IFX_PSI5_CH_SDS_SCRC_LEN (6)

/** \\brief  Mask for Ifx_PSI5_CH_SDS_Bits.SCRC */
#define IFX_PSI5_CH_SDS_SCRC_MSK (0x3f)

/** \\brief  Offset for Ifx_PSI5_CH_SDS_Bits.SCRC */
#define IFX_PSI5_CH_SDS_SCRC_OFF (24)

/** \\brief  Length for Ifx_PSI5_CH_SDS_Bits.SCRI */
#define IFX_PSI5_CH_SDS_SCRI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SDS_Bits.SCRI */
#define IFX_PSI5_CH_SDS_SCRI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SDS_Bits.SCRI */
#define IFX_PSI5_CH_SDS_SCRI_OFF (30)

/** \\brief  Length for Ifx_PSI5_CH_SDS_Bits.SD */
#define IFX_PSI5_CH_SDS_SD_LEN (16)

/** \\brief  Mask for Ifx_PSI5_CH_SDS_Bits.SD */
#define IFX_PSI5_CH_SDS_SD_MSK (0xffff)

/** \\brief  Offset for Ifx_PSI5_CH_SDS_Bits.SD */
#define IFX_PSI5_CH_SDS_SD_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_SFTSC_Bits.TS */
#define IFX_PSI5_CH_SFTSC_TS_LEN (24)

/** \\brief  Mask for Ifx_PSI5_CH_SFTSC_Bits.TS */
#define IFX_PSI5_CH_SFTSC_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5_CH_SFTSC_Bits.TS */
#define IFX_PSI5_CH_SFTSC_TS_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_SORH_Bits.SD32 */
#define IFX_PSI5_CH_SORH_SD32_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORH_Bits.SD32 */
#define IFX_PSI5_CH_SORH_SD32_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORH_Bits.SD32 */
#define IFX_PSI5_CH_SORH_SD32_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_SORH_Bits.SD33 */
#define IFX_PSI5_CH_SORH_SD33_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORH_Bits.SD33 */
#define IFX_PSI5_CH_SORH_SD33_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORH_Bits.SD33 */
#define IFX_PSI5_CH_SORH_SD33_OFF (1)

/** \\brief  Length for Ifx_PSI5_CH_SORH_Bits.SD34 */
#define IFX_PSI5_CH_SORH_SD34_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORH_Bits.SD34 */
#define IFX_PSI5_CH_SORH_SD34_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORH_Bits.SD34 */
#define IFX_PSI5_CH_SORH_SD34_OFF (2)

/** \\brief  Length for Ifx_PSI5_CH_SORH_Bits.SD35 */
#define IFX_PSI5_CH_SORH_SD35_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORH_Bits.SD35 */
#define IFX_PSI5_CH_SORH_SD35_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORH_Bits.SD35 */
#define IFX_PSI5_CH_SORH_SD35_OFF (3)

/** \\brief  Length for Ifx_PSI5_CH_SORH_Bits.SD36 */
#define IFX_PSI5_CH_SORH_SD36_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORH_Bits.SD36 */
#define IFX_PSI5_CH_SORH_SD36_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORH_Bits.SD36 */
#define IFX_PSI5_CH_SORH_SD36_OFF (4)

/** \\brief  Length for Ifx_PSI5_CH_SORH_Bits.SD37 */
#define IFX_PSI5_CH_SORH_SD37_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORH_Bits.SD37 */
#define IFX_PSI5_CH_SORH_SD37_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORH_Bits.SD37 */
#define IFX_PSI5_CH_SORH_SD37_OFF (5)

/** \\brief  Length for Ifx_PSI5_CH_SORH_Bits.SD38 */
#define IFX_PSI5_CH_SORH_SD38_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORH_Bits.SD38 */
#define IFX_PSI5_CH_SORH_SD38_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORH_Bits.SD38 */
#define IFX_PSI5_CH_SORH_SD38_OFF (6)

