keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD27 */
#define IFX_PSI5_CH_SORL_SD27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD27 */
#define IFX_PSI5_CH_SORL_SD27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD27 */
#define IFX_PSI5_CH_SORL_SD27_OFF (27)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD28 */
#define IFX_PSI5_CH_SORL_SD28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD28 */
#define IFX_PSI5_CH_SORL_SD28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD28 */
#define IFX_PSI5_CH_SORL_SD28_OFF (28)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD29 */
#define IFX_PSI5_CH_SORL_SD29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD29 */
#define IFX_PSI5_CH_SORL_SD29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD29 */
#define IFX_PSI5_CH_SORL_SD29_OFF (29)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD2 */
#define IFX_PSI5_CH_SORL_SD2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD2 */
#define IFX_PSI5_CH_SORL_SD2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD2 */
#define IFX_PSI5_CH_SORL_SD2_OFF (2)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD30 */
#define IFX_PSI5_CH_SORL_SD30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD30 */
#define IFX_PSI5_CH_SORL_SD30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD30 */
#define IFX_PSI5_CH_SORL_SD30_OFF (30)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_OFF (31)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_OFF (3)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD4 */
#define IFX_PSI5_CH_SORL_SD4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD4 */
#define IFX_PSI5_CH_SORL_SD4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD4 */
#define IFX_PSI5_CH_SORL_SD4_OFF (4)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD5 */
#define IFX_PSI5_CH_SORL_SD5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD5 */
#define IFX_PSI5_CH_SORL_SD5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD5 */
#define IFX_PSI5_CH_SORL_SD5_OFF (5)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD6 */
#define IFX_PSI5_CH_SORL_SD6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD6 */
#define IFX_PSI5_CH_SORL_SD6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD6 */
#define IFX_PSI5_CH_SORL_SD6_OFF (6)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD7 */
#define IFX_PSI5_CH_SORL_SD7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD7 */
#define IFX_PSI5_CH_SORL_SD7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD7 */
#define IFX_PSI5_CH_SORL_SD7_OFF (7)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD8 */
#define IFX_PSI5_CH_SORL_SD8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD8 */
#define IFX_PSI5_CH_SORL_SD8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD8 */
#define IFX_PSI5_CH_SORL_SD8_OFF (8)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD9 */
#define IFX_PSI5_CH_SORL_SD9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD9 */
#define IFX_PSI5_CH_SORL_SD9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD9 */
#define IFX_PSI5_CH_SORL_SD9_OFF (9)

/** \\brief  Length for Ifx_PSI5_CH_SPTSC_Bits.TS */
#define IFX_PSI5_CH_SPTSC_TS_LEN (24)

/** \\brief  Mask for Ifx_PSI5_CH_SPTSC_Bits.TS */
#define IFX_PSI5_CH_SPTSC_TS_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5_CH_SPTSC_Bits.TS */
#define IFX_PSI5_CH_SPTSC_TS_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD32 */
#define IFX_PSI5_CH_SSRH_SD32_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD32 */
#define IFX_PSI5_CH_SSRH_SD32_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD32 */
#define IFX_PSI5_CH_SSRH_SD32_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD33 */
#define IFX_PSI5_CH_SSRH_SD33_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD33 */
#define IFX_PSI5_CH_SSRH_SD33_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD33 */
#define IFX_PSI5_CH_SSRH_SD33_OFF (1)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD34 */
#define IFX_PSI5_CH_SSRH_SD34_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD34 */
#define IFX_PSI5_CH_SSRH_SD34_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD34 */
#define IFX_PSI5_CH_SSRH_SD34_OFF (2)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD35 */
#define IFX_PSI5_CH_SSRH_SD35_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD35 */
#define IFX_PSI5_CH_SSRH_SD35_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD35 */
#define IFX_PSI5_CH_SSRH_SD35_OFF (3)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD36 */
#define IFX_PSI5_CH_SSRH_SD36_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD36 */
#define IFX_PSI5_CH_SSRH_SD36_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD36 */
#define IFX_PSI5_CH_SSRH_SD36_OFF (4)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD37 */
#define IFX_PSI5_CH_SSRH_SD37_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD37 */
#define IFX_PSI5_CH_SSRH_SD37_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD37 */
#define IFX_PSI5_CH_SSRH_SD37_OFF (5)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD38 */
#define IFX_PSI5_CH_SSRH_SD38_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD38 */
#define IFX_PSI5_CH_SSRH_SD38_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD38 */
#define IFX_PSI5_CH_SSRH_SD38_OFF (6)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD39 */
#define IFX_PSI5_CH_SSRH_SD39_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD39 */
#define IFX_PSI5_CH_SSRH_SD39_MSK (0x1)

