keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD39 */
#define IFX_PSI5_CH_SSRH_SD39_OFF (7)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD40 */
#define IFX_PSI5_CH_SSRH_SD40_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD40 */
#define IFX_PSI5_CH_SSRH_SD40_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD40 */
#define IFX_PSI5_CH_SSRH_SD40_OFF (8)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD41 */
#define IFX_PSI5_CH_SSRH_SD41_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD41 */
#define IFX_PSI5_CH_SSRH_SD41_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD41 */
#define IFX_PSI5_CH_SSRH_SD41_OFF (9)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD42 */
#define IFX_PSI5_CH_SSRH_SD42_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD42 */
#define IFX_PSI5_CH_SSRH_SD42_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD42 */
#define IFX_PSI5_CH_SSRH_SD42_OFF (10)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD43 */
#define IFX_PSI5_CH_SSRH_SD43_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD43 */
#define IFX_PSI5_CH_SSRH_SD43_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD43 */
#define IFX_PSI5_CH_SSRH_SD43_OFF (11)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD44 */
#define IFX_PSI5_CH_SSRH_SD44_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD44 */
#define IFX_PSI5_CH_SSRH_SD44_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD44 */
#define IFX_PSI5_CH_SSRH_SD44_OFF (12)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD45 */
#define IFX_PSI5_CH_SSRH_SD45_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD45 */
#define IFX_PSI5_CH_SSRH_SD45_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD45 */
#define IFX_PSI5_CH_SSRH_SD45_OFF (13)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD46 */
#define IFX_PSI5_CH_SSRH_SD46_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD46 */
#define IFX_PSI5_CH_SSRH_SD46_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD46 */
#define IFX_PSI5_CH_SSRH_SD46_OFF (14)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD47 */
#define IFX_PSI5_CH_SSRH_SD47_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD47 */
#define IFX_PSI5_CH_SSRH_SD47_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD47 */
#define IFX_PSI5_CH_SSRH_SD47_OFF (15)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD48 */
#define IFX_PSI5_CH_SSRH_SD48_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD48 */
#define IFX_PSI5_CH_SSRH_SD48_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD48 */
#define IFX_PSI5_CH_SSRH_SD48_OFF (16)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD49 */
#define IFX_PSI5_CH_SSRH_SD49_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD49 */
#define IFX_PSI5_CH_SSRH_SD49_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD49 */
#define IFX_PSI5_CH_SSRH_SD49_OFF (17)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD50 */
#define IFX_PSI5_CH_SSRH_SD50_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD50 */
#define IFX_PSI5_CH_SSRH_SD50_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD50 */
#define IFX_PSI5_CH_SSRH_SD50_OFF (18)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD51 */
#define IFX_PSI5_CH_SSRH_SD51_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD51 */
#define IFX_PSI5_CH_SSRH_SD51_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD51 */
#define IFX_PSI5_CH_SSRH_SD51_OFF (19)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD52 */
#define IFX_PSI5_CH_SSRH_SD52_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD52 */
#define IFX_PSI5_CH_SSRH_SD52_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD52 */
#define IFX_PSI5_CH_SSRH_SD52_OFF (20)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD53 */
#define IFX_PSI5_CH_SSRH_SD53_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD53 */
#define IFX_PSI5_CH_SSRH_SD53_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD53 */
#define IFX_PSI5_CH_SSRH_SD53_OFF (21)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD54 */
#define IFX_PSI5_CH_SSRH_SD54_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD54 */
#define IFX_PSI5_CH_SSRH_SD54_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD54 */
#define IFX_PSI5_CH_SSRH_SD54_OFF (22)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD55 */
#define IFX_PSI5_CH_SSRH_SD55_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD55 */
#define IFX_PSI5_CH_SSRH_SD55_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD55 */
#define IFX_PSI5_CH_SSRH_SD55_OFF (23)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD56 */
#define IFX_PSI5_CH_SSRH_SD56_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD56 */
#define IFX_PSI5_CH_SSRH_SD56_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD56 */
#define IFX_PSI5_CH_SSRH_SD56_OFF (24)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD57 */
#define IFX_PSI5_CH_SSRH_SD57_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD57 */
#define IFX_PSI5_CH_SSRH_SD57_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD57 */
#define IFX_PSI5_CH_SSRH_SD57_OFF (25)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD58 */
#define IFX_PSI5_CH_SSRH_SD58_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD58 */
#define IFX_PSI5_CH_SSRH_SD58_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD58 */
#define IFX_PSI5_CH_SSRH_SD58_OFF (26)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD59 */
#define IFX_PSI5_CH_SSRH_SD59_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD59 */
#define IFX_PSI5_CH_SSRH_SD59_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD59 */
#define IFX_PSI5_CH_SSRH_SD59_OFF (27)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD60 */
#define IFX_PSI5_CH_SSRH_SD60_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD60 */
#define IFX_PSI5_CH_SSRH_SD60_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD60 */
#define IFX_PSI5_CH_SSRH_SD60_OFF (28)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD61 */
#define IFX_PSI5_CH_SSRH_SD61_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD61 */
#define IFX_PSI5_CH_SSRH_SD61_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD61 */
#define IFX_PSI5_CH_SSRH_SD61_OFF (29)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD62 */
#define IFX_PSI5_CH_SSRH_SD62_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD62 */
#define IFX_PSI5_CH_SSRH_SD62_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD62 */
#define IFX_PSI5_CH_SSRH_SD62_OFF (30)

/** \\brief  Length for Ifx_PSI5_CH_SSRH_Bits.SD63 */
#define IFX_PSI5_CH_SSRH_SD63_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRH_Bits.SD63 */
#define IFX_PSI5_CH_SSRH_SD63_MSK (0x1)

