keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_CH_SSRH_Bits.SD63 */
#define IFX_PSI5_CH_SSRH_SD63_OFF (31)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD0 */
#define IFX_PSI5_CH_SSRL_SD0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD0 */
#define IFX_PSI5_CH_SSRL_SD0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD0 */
#define IFX_PSI5_CH_SSRL_SD0_OFF (0)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD10 */
#define IFX_PSI5_CH_SSRL_SD10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD10 */
#define IFX_PSI5_CH_SSRL_SD10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD10 */
#define IFX_PSI5_CH_SSRL_SD10_OFF (10)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD11 */
#define IFX_PSI5_CH_SSRL_SD11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD11 */
#define IFX_PSI5_CH_SSRL_SD11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD11 */
#define IFX_PSI5_CH_SSRL_SD11_OFF (11)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD12 */
#define IFX_PSI5_CH_SSRL_SD12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD12 */
#define IFX_PSI5_CH_SSRL_SD12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD12 */
#define IFX_PSI5_CH_SSRL_SD12_OFF (12)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD13 */
#define IFX_PSI5_CH_SSRL_SD13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD13 */
#define IFX_PSI5_CH_SSRL_SD13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD13 */
#define IFX_PSI5_CH_SSRL_SD13_OFF (13)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD14 */
#define IFX_PSI5_CH_SSRL_SD14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD14 */
#define IFX_PSI5_CH_SSRL_SD14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD14 */
#define IFX_PSI5_CH_SSRL_SD14_OFF (14)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD15 */
#define IFX_PSI5_CH_SSRL_SD15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD15 */
#define IFX_PSI5_CH_SSRL_SD15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD15 */
#define IFX_PSI5_CH_SSRL_SD15_OFF (15)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD16 */
#define IFX_PSI5_CH_SSRL_SD16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD16 */
#define IFX_PSI5_CH_SSRL_SD16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD16 */
#define IFX_PSI5_CH_SSRL_SD16_OFF (16)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD17 */
#define IFX_PSI5_CH_SSRL_SD17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD17 */
#define IFX_PSI5_CH_SSRL_SD17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD17 */
#define IFX_PSI5_CH_SSRL_SD17_OFF (17)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD18 */
#define IFX_PSI5_CH_SSRL_SD18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD18 */
#define IFX_PSI5_CH_SSRL_SD18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD18 */
#define IFX_PSI5_CH_SSRL_SD18_OFF (18)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD19 */
#define IFX_PSI5_CH_SSRL_SD19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD19 */
#define IFX_PSI5_CH_SSRL_SD19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD19 */
#define IFX_PSI5_CH_SSRL_SD19_OFF (19)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD1 */
#define IFX_PSI5_CH_SSRL_SD1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD1 */
#define IFX_PSI5_CH_SSRL_SD1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD1 */
#define IFX_PSI5_CH_SSRL_SD1_OFF (1)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD20 */
#define IFX_PSI5_CH_SSRL_SD20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD20 */
#define IFX_PSI5_CH_SSRL_SD20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD20 */
#define IFX_PSI5_CH_SSRL_SD20_OFF (20)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD21 */
#define IFX_PSI5_CH_SSRL_SD21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD21 */
#define IFX_PSI5_CH_SSRL_SD21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD21 */
#define IFX_PSI5_CH_SSRL_SD21_OFF (21)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD22 */
#define IFX_PSI5_CH_SSRL_SD22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD22 */
#define IFX_PSI5_CH_SSRL_SD22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD22 */
#define IFX_PSI5_CH_SSRL_SD22_OFF (22)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD23 */
#define IFX_PSI5_CH_SSRL_SD23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD23 */
#define IFX_PSI5_CH_SSRL_SD23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD23 */
#define IFX_PSI5_CH_SSRL_SD23_OFF (23)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD24 */
#define IFX_PSI5_CH_SSRL_SD24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD24 */
#define IFX_PSI5_CH_SSRL_SD24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD24 */
#define IFX_PSI5_CH_SSRL_SD24_OFF (24)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD25 */
#define IFX_PSI5_CH_SSRL_SD25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD25 */
#define IFX_PSI5_CH_SSRL_SD25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD25 */
#define IFX_PSI5_CH_SSRL_SD25_OFF (25)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD26 */
#define IFX_PSI5_CH_SSRL_SD26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD26 */
#define IFX_PSI5_CH_SSRL_SD26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD26 */
#define IFX_PSI5_CH_SSRL_SD26_OFF (26)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD27 */
#define IFX_PSI5_CH_SSRL_SD27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD27 */
#define IFX_PSI5_CH_SSRL_SD27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD27 */
#define IFX_PSI5_CH_SSRL_SD27_OFF (27)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD28 */
#define IFX_PSI5_CH_SSRL_SD28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD28 */
#define IFX_PSI5_CH_SSRL_SD28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD28 */
#define IFX_PSI5_CH_SSRL_SD28_OFF (28)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD29 */
#define IFX_PSI5_CH_SSRL_SD29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD29 */
#define IFX_PSI5_CH_SSRL_SD29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD29 */
#define IFX_PSI5_CH_SSRL_SD29_OFF (29)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD2 */
#define IFX_PSI5_CH_SSRL_SD2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD2 */
#define IFX_PSI5_CH_SSRL_SD2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD2 */
#define IFX_PSI5_CH_SSRL_SD2_OFF (2)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD30 */
#define IFX_PSI5_CH_SSRL_SD30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD30 */
#define IFX_PSI5_CH_SSRL_SD30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD30 */
#define IFX_PSI5_CH_SSRL_SD30_OFF (30)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD31 */
#define IFX_PSI5_CH_SSRL_SD31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD31 */
#define IFX_PSI5_CH_SSRL_SD31_MSK (0x1)

