keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD31 */
#define IFX_PSI5_CH_SSRL_SD31_OFF (31)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD3 */
#define IFX_PSI5_CH_SSRL_SD3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD3 */
#define IFX_PSI5_CH_SSRL_SD3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD3 */
#define IFX_PSI5_CH_SSRL_SD3_OFF (3)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD4 */
#define IFX_PSI5_CH_SSRL_SD4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD4 */
#define IFX_PSI5_CH_SSRL_SD4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD4 */
#define IFX_PSI5_CH_SSRL_SD4_OFF (4)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD5 */
#define IFX_PSI5_CH_SSRL_SD5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD5 */
#define IFX_PSI5_CH_SSRL_SD5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD5 */
#define IFX_PSI5_CH_SSRL_SD5_OFF (5)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD6 */
#define IFX_PSI5_CH_SSRL_SD6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD6 */
#define IFX_PSI5_CH_SSRL_SD6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD6 */
#define IFX_PSI5_CH_SSRL_SD6_OFF (6)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD7 */
#define IFX_PSI5_CH_SSRL_SD7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD7 */
#define IFX_PSI5_CH_SSRL_SD7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD7 */
#define IFX_PSI5_CH_SSRL_SD7_OFF (7)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD8 */
#define IFX_PSI5_CH_SSRL_SD8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD8 */
#define IFX_PSI5_CH_SSRL_SD8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD8 */
#define IFX_PSI5_CH_SSRL_SD8_OFF (8)

/** \\brief  Length for Ifx_PSI5_CH_SSRL_Bits.SD9 */
#define IFX_PSI5_CH_SSRL_SD9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SSRL_Bits.SD9 */
#define IFX_PSI5_CH_SSRL_SD9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SSRL_Bits.SD9 */
#define IFX_PSI5_CH_SSRL_SD9_OFF (9)

/** \\brief  Length for Ifx_PSI5_CH_WDT_Bits.WDLxw */
#define IFX_PSI5_CH_WDT_WDLXW_LEN (16)

/** \\brief  Mask for Ifx_PSI5_CH_WDT_Bits.WDLxw */
#define IFX_PSI5_CH_WDT_WDLXW_MSK (0xffff)

/** \\brief  Offset for Ifx_PSI5_CH_WDT_Bits.WDLxw */
#define IFX_PSI5_CH_WDT_WDLXW_OFF (0)

/** \\brief  Length for Ifx_PSI5_CLC_Bits.DISR */
#define IFX_PSI5_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CLC_Bits.DISR */
#define IFX_PSI5_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CLC_Bits.DISR */
#define IFX_PSI5_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_PSI5_CLC_Bits.DISS */
#define IFX_PSI5_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CLC_Bits.DISS */
#define IFX_PSI5_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CLC_Bits.DISS */
#define IFX_PSI5_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI0 */
#define IFX_PSI5_CRCICLR_CRCI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI0 */
#define IFX_PSI5_CRCICLR_CRCI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI0 */
#define IFX_PSI5_CRCICLR_CRCI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI10 */
#define IFX_PSI5_CRCICLR_CRCI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI10 */
#define IFX_PSI5_CRCICLR_CRCI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI10 */
#define IFX_PSI5_CRCICLR_CRCI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI11 */
#define IFX_PSI5_CRCICLR_CRCI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI11 */
#define IFX_PSI5_CRCICLR_CRCI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI11 */
#define IFX_PSI5_CRCICLR_CRCI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI12 */
#define IFX_PSI5_CRCICLR_CRCI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI12 */
#define IFX_PSI5_CRCICLR_CRCI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI12 */
#define IFX_PSI5_CRCICLR_CRCI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI13 */
#define IFX_PSI5_CRCICLR_CRCI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI13 */
#define IFX_PSI5_CRCICLR_CRCI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI13 */
#define IFX_PSI5_CRCICLR_CRCI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI14 */
#define IFX_PSI5_CRCICLR_CRCI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI14 */
#define IFX_PSI5_CRCICLR_CRCI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI14 */
#define IFX_PSI5_CRCICLR_CRCI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI15 */
#define IFX_PSI5_CRCICLR_CRCI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI15 */
#define IFX_PSI5_CRCICLR_CRCI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI15 */
#define IFX_PSI5_CRCICLR_CRCI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI16 */
#define IFX_PSI5_CRCICLR_CRCI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI16 */
#define IFX_PSI5_CRCICLR_CRCI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI16 */
#define IFX_PSI5_CRCICLR_CRCI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI17 */
#define IFX_PSI5_CRCICLR_CRCI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI17 */
#define IFX_PSI5_CRCICLR_CRCI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI17 */
#define IFX_PSI5_CRCICLR_CRCI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI18 */
#define IFX_PSI5_CRCICLR_CRCI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI18 */
#define IFX_PSI5_CRCICLR_CRCI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI18 */
#define IFX_PSI5_CRCICLR_CRCI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI19 */
#define IFX_PSI5_CRCICLR_CRCI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI19 */
#define IFX_PSI5_CRCICLR_CRCI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI19 */
#define IFX_PSI5_CRCICLR_CRCI19_OFF (19)

