keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI1 */
#define IFX_PSI5_CRCICLR_CRCI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI1 */
#define IFX_PSI5_CRCICLR_CRCI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI1 */
#define IFX_PSI5_CRCICLR_CRCI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI20 */
#define IFX_PSI5_CRCICLR_CRCI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI20 */
#define IFX_PSI5_CRCICLR_CRCI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI20 */
#define IFX_PSI5_CRCICLR_CRCI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI21 */
#define IFX_PSI5_CRCICLR_CRCI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI21 */
#define IFX_PSI5_CRCICLR_CRCI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI21 */
#define IFX_PSI5_CRCICLR_CRCI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI22 */
#define IFX_PSI5_CRCICLR_CRCI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI22 */
#define IFX_PSI5_CRCICLR_CRCI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI22 */
#define IFX_PSI5_CRCICLR_CRCI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI23 */
#define IFX_PSI5_CRCICLR_CRCI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI23 */
#define IFX_PSI5_CRCICLR_CRCI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI23 */
#define IFX_PSI5_CRCICLR_CRCI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI24 */
#define IFX_PSI5_CRCICLR_CRCI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI24 */
#define IFX_PSI5_CRCICLR_CRCI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI24 */
#define IFX_PSI5_CRCICLR_CRCI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI25 */
#define IFX_PSI5_CRCICLR_CRCI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI25 */
#define IFX_PSI5_CRCICLR_CRCI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI25 */
#define IFX_PSI5_CRCICLR_CRCI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI26 */
#define IFX_PSI5_CRCICLR_CRCI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI26 */
#define IFX_PSI5_CRCICLR_CRCI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI26 */
#define IFX_PSI5_CRCICLR_CRCI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI27 */
#define IFX_PSI5_CRCICLR_CRCI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI27 */
#define IFX_PSI5_CRCICLR_CRCI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI27 */
#define IFX_PSI5_CRCICLR_CRCI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI28 */
#define IFX_PSI5_CRCICLR_CRCI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI28 */
#define IFX_PSI5_CRCICLR_CRCI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI28 */
#define IFX_PSI5_CRCICLR_CRCI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI29 */
#define IFX_PSI5_CRCICLR_CRCI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI29 */
#define IFX_PSI5_CRCICLR_CRCI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI29 */
#define IFX_PSI5_CRCICLR_CRCI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI2 */
#define IFX_PSI5_CRCICLR_CRCI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI2 */
#define IFX_PSI5_CRCICLR_CRCI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI2 */
#define IFX_PSI5_CRCICLR_CRCI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI30 */
#define IFX_PSI5_CRCICLR_CRCI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI30 */
#define IFX_PSI5_CRCICLR_CRCI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI30 */
#define IFX_PSI5_CRCICLR_CRCI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI31 */
#define IFX_PSI5_CRCICLR_CRCI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI31 */
#define IFX_PSI5_CRCICLR_CRCI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI31 */
#define IFX_PSI5_CRCICLR_CRCI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI3 */
#define IFX_PSI5_CRCICLR_CRCI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI3 */
#define IFX_PSI5_CRCICLR_CRCI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI3 */
#define IFX_PSI5_CRCICLR_CRCI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI4 */
#define IFX_PSI5_CRCICLR_CRCI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI4 */
#define IFX_PSI5_CRCICLR_CRCI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI4 */
#define IFX_PSI5_CRCICLR_CRCI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI5 */
#define IFX_PSI5_CRCICLR_CRCI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI5 */
#define IFX_PSI5_CRCICLR_CRCI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI5 */
#define IFX_PSI5_CRCICLR_CRCI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI6 */
#define IFX_PSI5_CRCICLR_CRCI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI6 */
#define IFX_PSI5_CRCICLR_CRCI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI6 */
#define IFX_PSI5_CRCICLR_CRCI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI7 */
#define IFX_PSI5_CRCICLR_CRCI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI7 */
#define IFX_PSI5_CRCICLR_CRCI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI7 */
#define IFX_PSI5_CRCICLR_CRCI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI8 */
#define IFX_PSI5_CRCICLR_CRCI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI8 */
#define IFX_PSI5_CRCICLR_CRCI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI8 */
#define IFX_PSI5_CRCICLR_CRCI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_CRCICLR_Bits.CRCI9 */
#define IFX_PSI5_CRCICLR_CRCI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCICLR_Bits.CRCI9 */
#define IFX_PSI5_CRCICLR_CRCI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCICLR_Bits.CRCI9 */
#define IFX_PSI5_CRCICLR_CRCI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI0 */
#define IFX_PSI5_CRCIOV_CRCI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI0 */
#define IFX_PSI5_CRCIOV_CRCI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI0 */
#define IFX_PSI5_CRCIOV_CRCI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI10 */
#define IFX_PSI5_CRCIOV_CRCI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI10 */
#define IFX_PSI5_CRCIOV_CRCI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI10 */
#define IFX_PSI5_CRCIOV_CRCI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_LEN (1)

