keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TPOI */
#define IFX_PSI5_INTSETA_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TPOI */
#define IFX_PSI5_INTSETA_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.TPOI */
#define IFX_PSI5_INTSETA_TPOI_OFF (11)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TSI */
#define IFX_PSI5_INTSETA_TSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TSI */
#define IFX_PSI5_INTSETA_TSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.TSI */
#define IFX_PSI5_INTSETA_TSI_OFF (12)

/** \\brief  Length for Ifx_PSI5_INTSETA_Bits.TSOI */
#define IFX_PSI5_INTSETA_TSOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETA_Bits.TSOI */
#define IFX_PSI5_INTSETA_TSOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETA_Bits.TSOI */
#define IFX_PSI5_INTSETA_TSOI_OFF (13)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI0 */
#define IFX_PSI5_INTSETB_SCRI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI0 */
#define IFX_PSI5_INTSETB_SCRI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI0 */
#define IFX_PSI5_INTSETB_SCRI0_OFF (18)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI1 */
#define IFX_PSI5_INTSETB_SCRI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI1 */
#define IFX_PSI5_INTSETB_SCRI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI1 */
#define IFX_PSI5_INTSETB_SCRI1_OFF (19)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI2 */
#define IFX_PSI5_INTSETB_SCRI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI2 */
#define IFX_PSI5_INTSETB_SCRI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI2 */
#define IFX_PSI5_INTSETB_SCRI2_OFF (20)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI3 */
#define IFX_PSI5_INTSETB_SCRI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI3 */
#define IFX_PSI5_INTSETB_SCRI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI3 */
#define IFX_PSI5_INTSETB_SCRI3_OFF (21)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI4 */
#define IFX_PSI5_INTSETB_SCRI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI4 */
#define IFX_PSI5_INTSETB_SCRI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI4 */
#define IFX_PSI5_INTSETB_SCRI4_OFF (22)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SCRI5 */
#define IFX_PSI5_INTSETB_SCRI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SCRI5 */
#define IFX_PSI5_INTSETB_SCRI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SCRI5 */
#define IFX_PSI5_INTSETB_SCRI5_OFF (23)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SDI0 */
#define IFX_PSI5_INTSETB_SDI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SDI0 */
#define IFX_PSI5_INTSETB_SDI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SDI0 */
#define IFX_PSI5_INTSETB_SDI0_OFF (6)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SDI1 */
#define IFX_PSI5_INTSETB_SDI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SDI1 */
#define IFX_PSI5_INTSETB_SDI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SDI1 */
#define IFX_PSI5_INTSETB_SDI1_OFF (7)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SDI2 */
#define IFX_PSI5_INTSETB_SDI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SDI2 */
#define IFX_PSI5_INTSETB_SDI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SDI2 */
#define IFX_PSI5_INTSETB_SDI2_OFF (8)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SDI3 */
#define IFX_PSI5_INTSETB_SDI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SDI3 */
#define IFX_PSI5_INTSETB_SDI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SDI3 */
#define IFX_PSI5_INTSETB_SDI3_OFF (9)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SDI4 */
#define IFX_PSI5_INTSETB_SDI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SDI4 */
#define IFX_PSI5_INTSETB_SDI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SDI4 */
#define IFX_PSI5_INTSETB_SDI4_OFF (10)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SDI5 */
#define IFX_PSI5_INTSETB_SDI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SDI5 */
#define IFX_PSI5_INTSETB_SDI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SDI5 */
#define IFX_PSI5_INTSETB_SDI5_OFF (11)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SOI0 */
#define IFX_PSI5_INTSETB_SOI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SOI0 */
#define IFX_PSI5_INTSETB_SOI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SOI0 */
#define IFX_PSI5_INTSETB_SOI0_OFF (12)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SOI1 */
#define IFX_PSI5_INTSETB_SOI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SOI1 */
#define IFX_PSI5_INTSETB_SOI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SOI1 */
#define IFX_PSI5_INTSETB_SOI1_OFF (13)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SOI2 */
#define IFX_PSI5_INTSETB_SOI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SOI2 */
#define IFX_PSI5_INTSETB_SOI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SOI2 */
#define IFX_PSI5_INTSETB_SOI2_OFF (14)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SOI3 */
#define IFX_PSI5_INTSETB_SOI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SOI3 */
#define IFX_PSI5_INTSETB_SOI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SOI3 */
#define IFX_PSI5_INTSETB_SOI3_OFF (15)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SOI4 */
#define IFX_PSI5_INTSETB_SOI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SOI4 */
#define IFX_PSI5_INTSETB_SOI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SOI4 */
#define IFX_PSI5_INTSETB_SOI4_OFF (16)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.SOI5 */
#define IFX_PSI5_INTSETB_SOI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.SOI5 */
#define IFX_PSI5_INTSETB_SOI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.SOI5 */
#define IFX_PSI5_INTSETB_SOI5_OFF (17)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.WSI0 */
#define IFX_PSI5_INTSETB_WSI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.WSI0 */
#define IFX_PSI5_INTSETB_WSI0_MSK (0x1)

