keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.WSI0 */
#define IFX_PSI5_INTSETB_WSI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.WSI1 */
#define IFX_PSI5_INTSETB_WSI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.WSI1 */
#define IFX_PSI5_INTSETB_WSI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.WSI1 */
#define IFX_PSI5_INTSETB_WSI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.WSI2 */
#define IFX_PSI5_INTSETB_WSI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.WSI2 */
#define IFX_PSI5_INTSETB_WSI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.WSI2 */
#define IFX_PSI5_INTSETB_WSI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.WSI3 */
#define IFX_PSI5_INTSETB_WSI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.WSI3 */
#define IFX_PSI5_INTSETB_WSI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.WSI3 */
#define IFX_PSI5_INTSETB_WSI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.WSI4 */
#define IFX_PSI5_INTSETB_WSI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.WSI4 */
#define IFX_PSI5_INTSETB_WSI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.WSI4 */
#define IFX_PSI5_INTSETB_WSI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_INTSETB_Bits.WSI5 */
#define IFX_PSI5_INTSETB_WSI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSETB_Bits.WSI5 */
#define IFX_PSI5_INTSETB_WSI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSETB_Bits.WSI5 */
#define IFX_PSI5_INTSETB_WSI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.CRCI */
#define IFX_PSI5_INTSTATA_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.CRCI */
#define IFX_PSI5_INTSTATA_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.CRCI */
#define IFX_PSI5_INTSTATA_CRCI_OFF (6)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.FWI */
#define IFX_PSI5_INTSTATA_FWI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.FWI */
#define IFX_PSI5_INTSTATA_FWI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.FWI */
#define IFX_PSI5_INTSTATA_FWI_OFF (7)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.MEI */
#define IFX_PSI5_INTSTATA_MEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.MEI */
#define IFX_PSI5_INTSTATA_MEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.MEI */
#define IFX_PSI5_INTSTATA_MEI_OFF (5)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.NBI */
#define IFX_PSI5_INTSTATA_NBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.NBI */
#define IFX_PSI5_INTSTATA_NBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.NBI */
#define IFX_PSI5_INTSTATA_NBI_OFF (4)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.NFI */
#define IFX_PSI5_INTSTATA_NFI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.NFI */
#define IFX_PSI5_INTSTATA_NFI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.NFI */
#define IFX_PSI5_INTSTATA_NFI_OFF (16)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.RBI */
#define IFX_PSI5_INTSTATA_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.RBI */
#define IFX_PSI5_INTSTATA_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.RBI */
#define IFX_PSI5_INTSTATA_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.RDI */
#define IFX_PSI5_INTSTATA_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.RDI */
#define IFX_PSI5_INTSTATA_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.RDI */
#define IFX_PSI5_INTSTATA_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.RMI */
#define IFX_PSI5_INTSTATA_RMI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.RMI */
#define IFX_PSI5_INTSTATA_RMI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.RMI */
#define IFX_PSI5_INTSTATA_RMI_OFF (9)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.RSI */
#define IFX_PSI5_INTSTATA_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.RSI */
#define IFX_PSI5_INTSTATA_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.RSI */
#define IFX_PSI5_INTSTATA_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.RUI */
#define IFX_PSI5_INTSTATA_RUI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.RUI */
#define IFX_PSI5_INTSTATA_RUI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.RUI */
#define IFX_PSI5_INTSTATA_RUI_OFF (8)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.TEI */
#define IFX_PSI5_INTSTATA_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.TEI */
#define IFX_PSI5_INTSTATA_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.TEI */
#define IFX_PSI5_INTSTATA_TEI_OFF (3)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.TOI */
#define IFX_PSI5_INTSTATA_TOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.TOI */
#define IFX_PSI5_INTSTATA_TOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.TOI */
#define IFX_PSI5_INTSTATA_TOI_OFF (14)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.TOOI */
#define IFX_PSI5_INTSTATA_TOOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.TOOI */
#define IFX_PSI5_INTSTATA_TOOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.TOOI */
#define IFX_PSI5_INTSTATA_TOOI_OFF (15)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.TPI */
#define IFX_PSI5_INTSTATA_TPI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.TPI */
#define IFX_PSI5_INTSTATA_TPI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.TPI */
#define IFX_PSI5_INTSTATA_TPI_OFF (10)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.TPOI */
#define IFX_PSI5_INTSTATA_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.TPOI */
#define IFX_PSI5_INTSTATA_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.TPOI */
#define IFX_PSI5_INTSTATA_TPOI_OFF (11)

/** \\brief  Length for Ifx_PSI5_INTSTATA_Bits.TSI */
#define IFX_PSI5_INTSTATA_TSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATA_Bits.TSI */
#define IFX_PSI5_INTSTATA_TSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATA_Bits.TSI */
#define IFX_PSI5_INTSTATA_TSI_OFF (12)

