keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI1 */
#define IFX_PSI5_INTSTATB_WSI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI1 */
#define IFX_PSI5_INTSTATB_WSI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI2 */
#define IFX_PSI5_INTSTATB_WSI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI2 */
#define IFX_PSI5_INTSTATB_WSI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI2 */
#define IFX_PSI5_INTSTATB_WSI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI3 */
#define IFX_PSI5_INTSTATB_WSI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI3 */
#define IFX_PSI5_INTSTATB_WSI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI3 */
#define IFX_PSI5_INTSTATB_WSI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI4 */
#define IFX_PSI5_INTSTATB_WSI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI4 */
#define IFX_PSI5_INTSTATB_WSI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI4 */
#define IFX_PSI5_INTSTATB_WSI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_INTSTATB_Bits.WSI5 */
#define IFX_PSI5_INTSTATB_WSI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTSTATB_Bits.WSI5 */
#define IFX_PSI5_INTSTATB_WSI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTSTATB_Bits.WSI5 */
#define IFX_PSI5_INTSTATB_WSI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_KRST0_Bits.RST */
#define IFX_PSI5_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_PSI5_KRST0_Bits.RST */
#define IFX_PSI5_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_KRST0_Bits.RST */
#define IFX_PSI5_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_PSI5_KRST0_Bits.RSTSTAT */
#define IFX_PSI5_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_PSI5_KRST0_Bits.RSTSTAT */
#define IFX_PSI5_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_KRST0_Bits.RSTSTAT */
#define IFX_PSI5_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_PSI5_KRST1_Bits.RST */
#define IFX_PSI5_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_PSI5_KRST1_Bits.RST */
#define IFX_PSI5_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_KRST1_Bits.RST */
#define IFX_PSI5_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_PSI5_KRSTCLR_Bits.CLR */
#define IFX_PSI5_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_PSI5_KRSTCLR_Bits.CLR */
#define IFX_PSI5_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_KRSTCLR_Bits.CLR */
#define IFX_PSI5_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI0 */
#define IFX_PSI5_MEICLR_MEI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI0 */
#define IFX_PSI5_MEICLR_MEI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI0 */
#define IFX_PSI5_MEICLR_MEI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI10 */
#define IFX_PSI5_MEICLR_MEI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI10 */
#define IFX_PSI5_MEICLR_MEI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI10 */
#define IFX_PSI5_MEICLR_MEI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI11 */
#define IFX_PSI5_MEICLR_MEI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI11 */
#define IFX_PSI5_MEICLR_MEI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI11 */
#define IFX_PSI5_MEICLR_MEI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI12 */
#define IFX_PSI5_MEICLR_MEI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI12 */
#define IFX_PSI5_MEICLR_MEI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI12 */
#define IFX_PSI5_MEICLR_MEI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI13 */
#define IFX_PSI5_MEICLR_MEI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI13 */
#define IFX_PSI5_MEICLR_MEI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI13 */
#define IFX_PSI5_MEICLR_MEI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI14 */
#define IFX_PSI5_MEICLR_MEI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI14 */
#define IFX_PSI5_MEICLR_MEI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI14 */
#define IFX_PSI5_MEICLR_MEI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI15 */
#define IFX_PSI5_MEICLR_MEI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI15 */
#define IFX_PSI5_MEICLR_MEI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI15 */
#define IFX_PSI5_MEICLR_MEI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI16 */
#define IFX_PSI5_MEICLR_MEI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI16 */
#define IFX_PSI5_MEICLR_MEI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI16 */
#define IFX_PSI5_MEICLR_MEI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI17 */
#define IFX_PSI5_MEICLR_MEI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI17 */
#define IFX_PSI5_MEICLR_MEI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI17 */
#define IFX_PSI5_MEICLR_MEI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI18 */
#define IFX_PSI5_MEICLR_MEI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI18 */
#define IFX_PSI5_MEICLR_MEI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI18 */
#define IFX_PSI5_MEICLR_MEI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI19 */
#define IFX_PSI5_MEICLR_MEI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI19 */
#define IFX_PSI5_MEICLR_MEI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI19 */
#define IFX_PSI5_MEICLR_MEI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI1 */
#define IFX_PSI5_MEICLR_MEI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEICLR_Bits.MEI1 */
#define IFX_PSI5_MEICLR_MEI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEICLR_Bits.MEI1 */
#define IFX_PSI5_MEICLR_MEI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_MEICLR_Bits.MEI20 */
#define IFX_PSI5_MEICLR_MEI20_LEN (1)

