keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI12 */
#define IFX_PSI5_MEIOV_MEI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI12 */
#define IFX_PSI5_MEIOV_MEI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI12 */
#define IFX_PSI5_MEIOV_MEI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI13 */
#define IFX_PSI5_MEIOV_MEI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI13 */
#define IFX_PSI5_MEIOV_MEI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI13 */
#define IFX_PSI5_MEIOV_MEI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI14 */
#define IFX_PSI5_MEIOV_MEI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI14 */
#define IFX_PSI5_MEIOV_MEI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI14 */
#define IFX_PSI5_MEIOV_MEI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI15 */
#define IFX_PSI5_MEIOV_MEI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI15 */
#define IFX_PSI5_MEIOV_MEI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI15 */
#define IFX_PSI5_MEIOV_MEI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI16 */
#define IFX_PSI5_MEIOV_MEI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI16 */
#define IFX_PSI5_MEIOV_MEI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI16 */
#define IFX_PSI5_MEIOV_MEI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI17 */
#define IFX_PSI5_MEIOV_MEI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI17 */
#define IFX_PSI5_MEIOV_MEI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI17 */
#define IFX_PSI5_MEIOV_MEI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI18 */
#define IFX_PSI5_MEIOV_MEI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI18 */
#define IFX_PSI5_MEIOV_MEI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI18 */
#define IFX_PSI5_MEIOV_MEI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI19 */
#define IFX_PSI5_MEIOV_MEI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI19 */
#define IFX_PSI5_MEIOV_MEI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI19 */
#define IFX_PSI5_MEIOV_MEI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI1 */
#define IFX_PSI5_MEIOV_MEI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI1 */
#define IFX_PSI5_MEIOV_MEI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI1 */
#define IFX_PSI5_MEIOV_MEI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI20 */
#define IFX_PSI5_MEIOV_MEI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI20 */
#define IFX_PSI5_MEIOV_MEI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI20 */
#define IFX_PSI5_MEIOV_MEI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI21 */
#define IFX_PSI5_MEIOV_MEI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI21 */
#define IFX_PSI5_MEIOV_MEI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI21 */
#define IFX_PSI5_MEIOV_MEI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI22 */
#define IFX_PSI5_MEIOV_MEI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI22 */
#define IFX_PSI5_MEIOV_MEI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI22 */
#define IFX_PSI5_MEIOV_MEI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI23 */
#define IFX_PSI5_MEIOV_MEI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI23 */
#define IFX_PSI5_MEIOV_MEI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI23 */
#define IFX_PSI5_MEIOV_MEI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI24 */
#define IFX_PSI5_MEIOV_MEI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI24 */
#define IFX_PSI5_MEIOV_MEI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI24 */
#define IFX_PSI5_MEIOV_MEI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI25 */
#define IFX_PSI5_MEIOV_MEI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI25 */
#define IFX_PSI5_MEIOV_MEI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI25 */
#define IFX_PSI5_MEIOV_MEI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI26 */
#define IFX_PSI5_MEIOV_MEI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI26 */
#define IFX_PSI5_MEIOV_MEI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI26 */
#define IFX_PSI5_MEIOV_MEI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI27 */
#define IFX_PSI5_MEIOV_MEI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI27 */
#define IFX_PSI5_MEIOV_MEI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI27 */
#define IFX_PSI5_MEIOV_MEI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI28 */
#define IFX_PSI5_MEIOV_MEI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI28 */
#define IFX_PSI5_MEIOV_MEI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI28 */
#define IFX_PSI5_MEIOV_MEI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI29 */
#define IFX_PSI5_MEIOV_MEI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI29 */
#define IFX_PSI5_MEIOV_MEI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI29 */
#define IFX_PSI5_MEIOV_MEI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI2 */
#define IFX_PSI5_MEIOV_MEI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI2 */
#define IFX_PSI5_MEIOV_MEI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI2 */
#define IFX_PSI5_MEIOV_MEI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI30 */
#define IFX_PSI5_MEIOV_MEI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI30 */
#define IFX_PSI5_MEIOV_MEI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI30 */
#define IFX_PSI5_MEIOV_MEI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI31 */
#define IFX_PSI5_MEIOV_MEI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI31 */
#define IFX_PSI5_MEIOV_MEI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI31 */
#define IFX_PSI5_MEIOV_MEI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI3 */
#define IFX_PSI5_MEIOV_MEI3_LEN (1)

