keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI3 */
#define IFX_PSI5_MEIOV_MEI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI3 */
#define IFX_PSI5_MEIOV_MEI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI4 */
#define IFX_PSI5_MEIOV_MEI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI4 */
#define IFX_PSI5_MEIOV_MEI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI4 */
#define IFX_PSI5_MEIOV_MEI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI5 */
#define IFX_PSI5_MEIOV_MEI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI5 */
#define IFX_PSI5_MEIOV_MEI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI5 */
#define IFX_PSI5_MEIOV_MEI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI6 */
#define IFX_PSI5_MEIOV_MEI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI6 */
#define IFX_PSI5_MEIOV_MEI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI6 */
#define IFX_PSI5_MEIOV_MEI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI7 */
#define IFX_PSI5_MEIOV_MEI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI7 */
#define IFX_PSI5_MEIOV_MEI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI7 */
#define IFX_PSI5_MEIOV_MEI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI8 */
#define IFX_PSI5_MEIOV_MEI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI8 */
#define IFX_PSI5_MEIOV_MEI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI8 */
#define IFX_PSI5_MEIOV_MEI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI9 */
#define IFX_PSI5_MEIOV_MEI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI9 */
#define IFX_PSI5_MEIOV_MEI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI9 */
#define IFX_PSI5_MEIOV_MEI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI0 */
#define IFX_PSI5_MEISET_MEI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI0 */
#define IFX_PSI5_MEISET_MEI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI0 */
#define IFX_PSI5_MEISET_MEI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI10 */
#define IFX_PSI5_MEISET_MEI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI10 */
#define IFX_PSI5_MEISET_MEI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI10 */
#define IFX_PSI5_MEISET_MEI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI11 */
#define IFX_PSI5_MEISET_MEI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI11 */
#define IFX_PSI5_MEISET_MEI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI11 */
#define IFX_PSI5_MEISET_MEI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI12 */
#define IFX_PSI5_MEISET_MEI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI12 */
#define IFX_PSI5_MEISET_MEI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI12 */
#define IFX_PSI5_MEISET_MEI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI13 */
#define IFX_PSI5_MEISET_MEI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI13 */
#define IFX_PSI5_MEISET_MEI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI13 */
#define IFX_PSI5_MEISET_MEI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_MSK (0x1)

