keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI6 */
#define IFX_PSI5_MEISET_MEI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI6 */
#define IFX_PSI5_MEISET_MEI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI6 */
#define IFX_PSI5_MEISET_MEI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI7 */
#define IFX_PSI5_MEISET_MEI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI7 */
#define IFX_PSI5_MEISET_MEI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI7 */
#define IFX_PSI5_MEISET_MEI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI8 */
#define IFX_PSI5_MEISET_MEI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI8 */
#define IFX_PSI5_MEISET_MEI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI8 */
#define IFX_PSI5_MEISET_MEI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI9 */
#define IFX_PSI5_MEISET_MEI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI9 */
#define IFX_PSI5_MEISET_MEI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI9 */
#define IFX_PSI5_MEISET_MEI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_NBICLR_Bits.NBI0 */
#define IFX_PSI5_NBICLR_NBI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI0 */
#define IFX_PSI5_NBICLR_NBI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI0 */
#define IFX_PSI5_NBICLR_NBI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_NBICLR_Bits.NBI10 */
#define IFX_PSI5_NBICLR_NBI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI10 */
#define IFX_PSI5_NBICLR_NBI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI10 */
#define IFX_PSI5_NBICLR_NBI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_NBICLR_Bits.NBI11 */
#define IFX_PSI5_NBICLR_NBI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI11 */
#define IFX_PSI5_NBICLR_NBI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI11 */
#define IFX_PSI5_NBICLR_NBI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_NBICLR_Bits.NBI12 */
#define IFX_PSI5_NBICLR_NBI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI12 */
#define IFX_PSI5_NBICLR_NBI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBICLR_Bits.NBI12 */
#define IFX_PSI5_NBICLR_NBI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_NBICLR_Bits.NBI13 */
#define IFX_PSI5_NBICLR_NBI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBICLR_Bits.NBI13 */
#define IFX_PSI5_NBICLR_NBI13_MSK (0x1)

