keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI28 */
#define IFX_PSI5_NBIOV_NBI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI28 */
#define IFX_PSI5_NBIOV_NBI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI28 */
#define IFX_PSI5_NBIOV_NBI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI29 */
#define IFX_PSI5_NBIOV_NBI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI29 */
#define IFX_PSI5_NBIOV_NBI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI29 */
#define IFX_PSI5_NBIOV_NBI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI2 */
#define IFX_PSI5_NBIOV_NBI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI2 */
#define IFX_PSI5_NBIOV_NBI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI2 */
#define IFX_PSI5_NBIOV_NBI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI30 */
#define IFX_PSI5_NBIOV_NBI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI30 */
#define IFX_PSI5_NBIOV_NBI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI30 */
#define IFX_PSI5_NBIOV_NBI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI31 */
#define IFX_PSI5_NBIOV_NBI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI31 */
#define IFX_PSI5_NBIOV_NBI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI31 */
#define IFX_PSI5_NBIOV_NBI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI3 */
#define IFX_PSI5_NBIOV_NBI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI3 */
#define IFX_PSI5_NBIOV_NBI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI3 */
#define IFX_PSI5_NBIOV_NBI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI4 */
#define IFX_PSI5_NBIOV_NBI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI4 */
#define IFX_PSI5_NBIOV_NBI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI4 */
#define IFX_PSI5_NBIOV_NBI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI5 */
#define IFX_PSI5_NBIOV_NBI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI5 */
#define IFX_PSI5_NBIOV_NBI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI5 */
#define IFX_PSI5_NBIOV_NBI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI6 */
#define IFX_PSI5_NBIOV_NBI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI6 */
#define IFX_PSI5_NBIOV_NBI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI6 */
#define IFX_PSI5_NBIOV_NBI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI7 */
#define IFX_PSI5_NBIOV_NBI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI7 */
#define IFX_PSI5_NBIOV_NBI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI7 */
#define IFX_PSI5_NBIOV_NBI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI8 */
#define IFX_PSI5_NBIOV_NBI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI8 */
#define IFX_PSI5_NBIOV_NBI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI8 */
#define IFX_PSI5_NBIOV_NBI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_NBIOV_Bits.NBI9 */
#define IFX_PSI5_NBIOV_NBI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBIOV_Bits.NBI9 */
#define IFX_PSI5_NBIOV_NBI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBIOV_Bits.NBI9 */
#define IFX_PSI5_NBIOV_NBI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI0 */
#define IFX_PSI5_NBISET_NBI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI0 */
#define IFX_PSI5_NBISET_NBI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI0 */
#define IFX_PSI5_NBISET_NBI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI10 */
#define IFX_PSI5_NBISET_NBI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI10 */
#define IFX_PSI5_NBISET_NBI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI10 */
#define IFX_PSI5_NBISET_NBI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI11 */
#define IFX_PSI5_NBISET_NBI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI11 */
#define IFX_PSI5_NBISET_NBI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI11 */
#define IFX_PSI5_NBISET_NBI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI12 */
#define IFX_PSI5_NBISET_NBI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI12 */
#define IFX_PSI5_NBISET_NBI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI12 */
#define IFX_PSI5_NBISET_NBI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI13 */
#define IFX_PSI5_NBISET_NBI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI13 */
#define IFX_PSI5_NBISET_NBI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI13 */
#define IFX_PSI5_NBISET_NBI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI14 */
#define IFX_PSI5_NBISET_NBI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI14 */
#define IFX_PSI5_NBISET_NBI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI14 */
#define IFX_PSI5_NBISET_NBI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI15 */
#define IFX_PSI5_NBISET_NBI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI15 */
#define IFX_PSI5_NBISET_NBI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI15 */
#define IFX_PSI5_NBISET_NBI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI16 */
#define IFX_PSI5_NBISET_NBI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI16 */
#define IFX_PSI5_NBISET_NBI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI16 */
#define IFX_PSI5_NBISET_NBI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI17 */
#define IFX_PSI5_NBISET_NBI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI17 */
#define IFX_PSI5_NBISET_NBI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI17 */
#define IFX_PSI5_NBISET_NBI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI18 */
#define IFX_PSI5_NBISET_NBI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI18 */
#define IFX_PSI5_NBISET_NBI18_MSK (0x1)

