keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI18 */
#define IFX_PSI5_NBISET_NBI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI19 */
#define IFX_PSI5_NBISET_NBI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI19 */
#define IFX_PSI5_NBISET_NBI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI19 */
#define IFX_PSI5_NBISET_NBI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI1 */
#define IFX_PSI5_NBISET_NBI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI1 */
#define IFX_PSI5_NBISET_NBI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI1 */
#define IFX_PSI5_NBISET_NBI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI20 */
#define IFX_PSI5_NBISET_NBI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI20 */
#define IFX_PSI5_NBISET_NBI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI20 */
#define IFX_PSI5_NBISET_NBI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI21 */
#define IFX_PSI5_NBISET_NBI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI21 */
#define IFX_PSI5_NBISET_NBI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI21 */
#define IFX_PSI5_NBISET_NBI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI22 */
#define IFX_PSI5_NBISET_NBI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI22 */
#define IFX_PSI5_NBISET_NBI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI22 */
#define IFX_PSI5_NBISET_NBI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI23 */
#define IFX_PSI5_NBISET_NBI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI23 */
#define IFX_PSI5_NBISET_NBI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI23 */
#define IFX_PSI5_NBISET_NBI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI24 */
#define IFX_PSI5_NBISET_NBI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI24 */
#define IFX_PSI5_NBISET_NBI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI24 */
#define IFX_PSI5_NBISET_NBI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI25 */
#define IFX_PSI5_NBISET_NBI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI25 */
#define IFX_PSI5_NBISET_NBI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI25 */
#define IFX_PSI5_NBISET_NBI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI26 */
#define IFX_PSI5_NBISET_NBI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI26 */
#define IFX_PSI5_NBISET_NBI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI26 */
#define IFX_PSI5_NBISET_NBI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI27 */
#define IFX_PSI5_NBISET_NBI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI27 */
#define IFX_PSI5_NBISET_NBI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI27 */
#define IFX_PSI5_NBISET_NBI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI28 */
#define IFX_PSI5_NBISET_NBI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI28 */
#define IFX_PSI5_NBISET_NBI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI28 */
#define IFX_PSI5_NBISET_NBI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI29 */
#define IFX_PSI5_NBISET_NBI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI29 */
#define IFX_PSI5_NBISET_NBI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI29 */
#define IFX_PSI5_NBISET_NBI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI2 */
#define IFX_PSI5_NBISET_NBI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI2 */
#define IFX_PSI5_NBISET_NBI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI2 */
#define IFX_PSI5_NBISET_NBI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI30 */
#define IFX_PSI5_NBISET_NBI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI30 */
#define IFX_PSI5_NBISET_NBI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI30 */
#define IFX_PSI5_NBISET_NBI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI31 */
#define IFX_PSI5_NBISET_NBI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI31 */
#define IFX_PSI5_NBISET_NBI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI31 */
#define IFX_PSI5_NBISET_NBI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI3 */
#define IFX_PSI5_NBISET_NBI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI3 */
#define IFX_PSI5_NBISET_NBI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI3 */
#define IFX_PSI5_NBISET_NBI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI4 */
#define IFX_PSI5_NBISET_NBI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI4 */
#define IFX_PSI5_NBISET_NBI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI4 */
#define IFX_PSI5_NBISET_NBI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI5 */
#define IFX_PSI5_NBISET_NBI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI5 */
#define IFX_PSI5_NBISET_NBI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI5 */
#define IFX_PSI5_NBISET_NBI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI6 */
#define IFX_PSI5_NBISET_NBI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI6 */
#define IFX_PSI5_NBISET_NBI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI6 */
#define IFX_PSI5_NBISET_NBI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI7 */
#define IFX_PSI5_NBISET_NBI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI7 */
#define IFX_PSI5_NBISET_NBI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI7 */
#define IFX_PSI5_NBISET_NBI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_NBISET_Bits.NBI8 */
#define IFX_PSI5_NBISET_NBI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NBISET_Bits.NBI8 */
#define IFX_PSI5_NBISET_NBI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NBISET_Bits.NBI8 */
#define IFX_PSI5_NBISET_NBI8_OFF (8)

