keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI28 */
#define IFX_PSI5_NFICLR_NFI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI29 */
#define IFX_PSI5_NFICLR_NFI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI29 */
#define IFX_PSI5_NFICLR_NFI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI29 */
#define IFX_PSI5_NFICLR_NFI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI2 */
#define IFX_PSI5_NFICLR_NFI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI2 */
#define IFX_PSI5_NFICLR_NFI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI2 */
#define IFX_PSI5_NFICLR_NFI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI30 */
#define IFX_PSI5_NFICLR_NFI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI30 */
#define IFX_PSI5_NFICLR_NFI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI30 */
#define IFX_PSI5_NFICLR_NFI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI31 */
#define IFX_PSI5_NFICLR_NFI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI31 */
#define IFX_PSI5_NFICLR_NFI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI31 */
#define IFX_PSI5_NFICLR_NFI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI3 */
#define IFX_PSI5_NFICLR_NFI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI3 */
#define IFX_PSI5_NFICLR_NFI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI3 */
#define IFX_PSI5_NFICLR_NFI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI4 */
#define IFX_PSI5_NFICLR_NFI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI4 */
#define IFX_PSI5_NFICLR_NFI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI4 */
#define IFX_PSI5_NFICLR_NFI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI5 */
#define IFX_PSI5_NFICLR_NFI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI5 */
#define IFX_PSI5_NFICLR_NFI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI5 */
#define IFX_PSI5_NFICLR_NFI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI6 */
#define IFX_PSI5_NFICLR_NFI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI6 */
#define IFX_PSI5_NFICLR_NFI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI6 */
#define IFX_PSI5_NFICLR_NFI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI7 */
#define IFX_PSI5_NFICLR_NFI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI7 */
#define IFX_PSI5_NFICLR_NFI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI7 */
#define IFX_PSI5_NFICLR_NFI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI8 */
#define IFX_PSI5_NFICLR_NFI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI8 */
#define IFX_PSI5_NFICLR_NFI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI8 */
#define IFX_PSI5_NFICLR_NFI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI9 */
#define IFX_PSI5_NFICLR_NFI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI9 */
#define IFX_PSI5_NFICLR_NFI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI9 */
#define IFX_PSI5_NFICLR_NFI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI0 */
#define IFX_PSI5_NFIOV_NFI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI0 */
#define IFX_PSI5_NFIOV_NFI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI0 */
#define IFX_PSI5_NFIOV_NFI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI10 */
#define IFX_PSI5_NFIOV_NFI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI10 */
#define IFX_PSI5_NFIOV_NFI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI10 */
#define IFX_PSI5_NFIOV_NFI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI11 */
#define IFX_PSI5_NFIOV_NFI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI11 */
#define IFX_PSI5_NFIOV_NFI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI11 */
#define IFX_PSI5_NFIOV_NFI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI12 */
#define IFX_PSI5_NFIOV_NFI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI12 */
#define IFX_PSI5_NFIOV_NFI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI12 */
#define IFX_PSI5_NFIOV_NFI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI13 */
#define IFX_PSI5_NFIOV_NFI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI13 */
#define IFX_PSI5_NFIOV_NFI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI13 */
#define IFX_PSI5_NFIOV_NFI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI14 */
#define IFX_PSI5_NFIOV_NFI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI14 */
#define IFX_PSI5_NFIOV_NFI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI14 */
#define IFX_PSI5_NFIOV_NFI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI15 */
#define IFX_PSI5_NFIOV_NFI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI15 */
#define IFX_PSI5_NFIOV_NFI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI15 */
#define IFX_PSI5_NFIOV_NFI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI16 */
#define IFX_PSI5_NFIOV_NFI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI16 */
#define IFX_PSI5_NFIOV_NFI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI16 */
#define IFX_PSI5_NFIOV_NFI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI17 */
#define IFX_PSI5_NFIOV_NFI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI17 */
#define IFX_PSI5_NFIOV_NFI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI17 */
#define IFX_PSI5_NFIOV_NFI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI18 */
#define IFX_PSI5_NFIOV_NFI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI18 */
#define IFX_PSI5_NFIOV_NFI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI18 */
#define IFX_PSI5_NFIOV_NFI18_OFF (18)

