keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI30 */
#define IFX_PSI5_NFISET_NFI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI30 */
#define IFX_PSI5_NFISET_NFI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI30 */
#define IFX_PSI5_NFISET_NFI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI31 */
#define IFX_PSI5_NFISET_NFI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI31 */
#define IFX_PSI5_NFISET_NFI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI31 */
#define IFX_PSI5_NFISET_NFI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI3 */
#define IFX_PSI5_NFISET_NFI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI3 */
#define IFX_PSI5_NFISET_NFI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI3 */
#define IFX_PSI5_NFISET_NFI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI4 */
#define IFX_PSI5_NFISET_NFI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI4 */
#define IFX_PSI5_NFISET_NFI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI4 */
#define IFX_PSI5_NFISET_NFI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI5 */
#define IFX_PSI5_NFISET_NFI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI5 */
#define IFX_PSI5_NFISET_NFI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI5 */
#define IFX_PSI5_NFISET_NFI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI6 */
#define IFX_PSI5_NFISET_NFI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI6 */
#define IFX_PSI5_NFISET_NFI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI6 */
#define IFX_PSI5_NFISET_NFI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI7 */
#define IFX_PSI5_NFISET_NFI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI7 */
#define IFX_PSI5_NFISET_NFI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI7 */
#define IFX_PSI5_NFISET_NFI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI8 */
#define IFX_PSI5_NFISET_NFI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI8 */
#define IFX_PSI5_NFISET_NFI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI8 */
#define IFX_PSI5_NFISET_NFI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_NFISET_Bits.NFI9 */
#define IFX_PSI5_NFISET_NFI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFISET_Bits.NFI9 */
#define IFX_PSI5_NFISET_NFI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFISET_Bits.NFI9 */
#define IFX_PSI5_NFISET_NFI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_OCS_Bits.SUS */
#define IFX_PSI5_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_PSI5_OCS_Bits.SUS */
#define IFX_PSI5_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5_OCS_Bits.SUS */
#define IFX_PSI5_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_PSI5_OCS_Bits.SUS_P */
#define IFX_PSI5_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_PSI5_OCS_Bits.SUS_P */
#define IFX_PSI5_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_OCS_Bits.SUS_P */
#define IFX_PSI5_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_PSI5_OCS_Bits.SUSSTA */
#define IFX_PSI5_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_PSI5_OCS_Bits.SUSSTA */
#define IFX_PSI5_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_OCS_Bits.SUSSTA */
#define IFX_PSI5_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_PSI5_RDF_Bits.RD */
#define IFX_PSI5_RDF_RD_LEN (32)

/** \\brief  Mask for Ifx_PSI5_RDF_Bits.RD */
#define IFX_PSI5_RDF_RD_MSK (0xffffffff)

/** \\brief  Offset for Ifx_PSI5_RDF_Bits.RD */
#define IFX_PSI5_RDF_RD_OFF (0)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI0 */
#define IFX_PSI5_RDICLR_RDI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI0 */
#define IFX_PSI5_RDICLR_RDI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI0 */
#define IFX_PSI5_RDICLR_RDI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI10 */
#define IFX_PSI5_RDICLR_RDI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI10 */
#define IFX_PSI5_RDICLR_RDI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI10 */
#define IFX_PSI5_RDICLR_RDI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI11 */
#define IFX_PSI5_RDICLR_RDI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI11 */
#define IFX_PSI5_RDICLR_RDI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI11 */
#define IFX_PSI5_RDICLR_RDI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI12 */
#define IFX_PSI5_RDICLR_RDI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI12 */
#define IFX_PSI5_RDICLR_RDI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI12 */
#define IFX_PSI5_RDICLR_RDI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI13 */
#define IFX_PSI5_RDICLR_RDI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI13 */
#define IFX_PSI5_RDICLR_RDI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI13 */
#define IFX_PSI5_RDICLR_RDI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI14 */
#define IFX_PSI5_RDICLR_RDI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI14 */
#define IFX_PSI5_RDICLR_RDI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI14 */
#define IFX_PSI5_RDICLR_RDI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI15 */
#define IFX_PSI5_RDICLR_RDI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI15 */
#define IFX_PSI5_RDICLR_RDI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI15 */
#define IFX_PSI5_RDICLR_RDI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI16 */
#define IFX_PSI5_RDICLR_RDI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI16 */
#define IFX_PSI5_RDICLR_RDI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI16 */
#define IFX_PSI5_RDICLR_RDI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI17 */
#define IFX_PSI5_RDICLR_RDI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI17 */
#define IFX_PSI5_RDICLR_RDI17_MSK (0x1)

