keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI17 */
#define IFX_PSI5_RDICLR_RDI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI18 */
#define IFX_PSI5_RDICLR_RDI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI18 */
#define IFX_PSI5_RDICLR_RDI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI18 */
#define IFX_PSI5_RDICLR_RDI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI19 */
#define IFX_PSI5_RDICLR_RDI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI19 */
#define IFX_PSI5_RDICLR_RDI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI19 */
#define IFX_PSI5_RDICLR_RDI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI1 */
#define IFX_PSI5_RDICLR_RDI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI1 */
#define IFX_PSI5_RDICLR_RDI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI1 */
#define IFX_PSI5_RDICLR_RDI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI20 */
#define IFX_PSI5_RDICLR_RDI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI20 */
#define IFX_PSI5_RDICLR_RDI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI20 */
#define IFX_PSI5_RDICLR_RDI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI21 */
#define IFX_PSI5_RDICLR_RDI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI21 */
#define IFX_PSI5_RDICLR_RDI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI21 */
#define IFX_PSI5_RDICLR_RDI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI22 */
#define IFX_PSI5_RDICLR_RDI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI22 */
#define IFX_PSI5_RDICLR_RDI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI22 */
#define IFX_PSI5_RDICLR_RDI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI23 */
#define IFX_PSI5_RDICLR_RDI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI23 */
#define IFX_PSI5_RDICLR_RDI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI23 */
#define IFX_PSI5_RDICLR_RDI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI24 */
#define IFX_PSI5_RDICLR_RDI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI24 */
#define IFX_PSI5_RDICLR_RDI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI24 */
#define IFX_PSI5_RDICLR_RDI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI25 */
#define IFX_PSI5_RDICLR_RDI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI25 */
#define IFX_PSI5_RDICLR_RDI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI25 */
#define IFX_PSI5_RDICLR_RDI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI26 */
#define IFX_PSI5_RDICLR_RDI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI26 */
#define IFX_PSI5_RDICLR_RDI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI26 */
#define IFX_PSI5_RDICLR_RDI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI27 */
#define IFX_PSI5_RDICLR_RDI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI27 */
#define IFX_PSI5_RDICLR_RDI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI27 */
#define IFX_PSI5_RDICLR_RDI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI28 */
#define IFX_PSI5_RDICLR_RDI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI28 */
#define IFX_PSI5_RDICLR_RDI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI28 */
#define IFX_PSI5_RDICLR_RDI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI29 */
#define IFX_PSI5_RDICLR_RDI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI29 */
#define IFX_PSI5_RDICLR_RDI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI29 */
#define IFX_PSI5_RDICLR_RDI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI2 */
#define IFX_PSI5_RDICLR_RDI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI2 */
#define IFX_PSI5_RDICLR_RDI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI2 */
#define IFX_PSI5_RDICLR_RDI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI30 */
#define IFX_PSI5_RDICLR_RDI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI30 */
#define IFX_PSI5_RDICLR_RDI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI30 */
#define IFX_PSI5_RDICLR_RDI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI31 */
#define IFX_PSI5_RDICLR_RDI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI31 */
#define IFX_PSI5_RDICLR_RDI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI31 */
#define IFX_PSI5_RDICLR_RDI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI3 */
#define IFX_PSI5_RDICLR_RDI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI3 */
#define IFX_PSI5_RDICLR_RDI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI3 */
#define IFX_PSI5_RDICLR_RDI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI4 */
#define IFX_PSI5_RDICLR_RDI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI4 */
#define IFX_PSI5_RDICLR_RDI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI4 */
#define IFX_PSI5_RDICLR_RDI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI5 */
#define IFX_PSI5_RDICLR_RDI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI5 */
#define IFX_PSI5_RDICLR_RDI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI5 */
#define IFX_PSI5_RDICLR_RDI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI6 */
#define IFX_PSI5_RDICLR_RDI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI6 */
#define IFX_PSI5_RDICLR_RDI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI6 */
#define IFX_PSI5_RDICLR_RDI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI7 */
#define IFX_PSI5_RDICLR_RDI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI7 */
#define IFX_PSI5_RDICLR_RDI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI7 */
#define IFX_PSI5_RDICLR_RDI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI8 */
#define IFX_PSI5_RDICLR_RDI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI8 */
#define IFX_PSI5_RDICLR_RDI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI8 */
#define IFX_PSI5_RDICLR_RDI8_OFF (8)

