keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_RDICLR_Bits.RDI9 */
#define IFX_PSI5_RDICLR_RDI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDICLR_Bits.RDI9 */
#define IFX_PSI5_RDICLR_RDI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDICLR_Bits.RDI9 */
#define IFX_PSI5_RDICLR_RDI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI0 */
#define IFX_PSI5_RDIOV_RDI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI0 */
#define IFX_PSI5_RDIOV_RDI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI0 */
#define IFX_PSI5_RDIOV_RDI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI10 */
#define IFX_PSI5_RDIOV_RDI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI10 */
#define IFX_PSI5_RDIOV_RDI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI10 */
#define IFX_PSI5_RDIOV_RDI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI11 */
#define IFX_PSI5_RDIOV_RDI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI11 */
#define IFX_PSI5_RDIOV_RDI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI11 */
#define IFX_PSI5_RDIOV_RDI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI12 */
#define IFX_PSI5_RDIOV_RDI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI12 */
#define IFX_PSI5_RDIOV_RDI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI12 */
#define IFX_PSI5_RDIOV_RDI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI13 */
#define IFX_PSI5_RDIOV_RDI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI13 */
#define IFX_PSI5_RDIOV_RDI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI13 */
#define IFX_PSI5_RDIOV_RDI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI14 */
#define IFX_PSI5_RDIOV_RDI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI14 */
#define IFX_PSI5_RDIOV_RDI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI14 */
#define IFX_PSI5_RDIOV_RDI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI15 */
#define IFX_PSI5_RDIOV_RDI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI15 */
#define IFX_PSI5_RDIOV_RDI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI15 */
#define IFX_PSI5_RDIOV_RDI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI16 */
#define IFX_PSI5_RDIOV_RDI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI16 */
#define IFX_PSI5_RDIOV_RDI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI16 */
#define IFX_PSI5_RDIOV_RDI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI17 */
#define IFX_PSI5_RDIOV_RDI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI17 */
#define IFX_PSI5_RDIOV_RDI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI17 */
#define IFX_PSI5_RDIOV_RDI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI18 */
#define IFX_PSI5_RDIOV_RDI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI18 */
#define IFX_PSI5_RDIOV_RDI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI18 */
#define IFX_PSI5_RDIOV_RDI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI19 */
#define IFX_PSI5_RDIOV_RDI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI19 */
#define IFX_PSI5_RDIOV_RDI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI19 */
#define IFX_PSI5_RDIOV_RDI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI1 */
#define IFX_PSI5_RDIOV_RDI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI1 */
#define IFX_PSI5_RDIOV_RDI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI1 */
#define IFX_PSI5_RDIOV_RDI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI20 */
#define IFX_PSI5_RDIOV_RDI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI20 */
#define IFX_PSI5_RDIOV_RDI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI20 */
#define IFX_PSI5_RDIOV_RDI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI21 */
#define IFX_PSI5_RDIOV_RDI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI21 */
#define IFX_PSI5_RDIOV_RDI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI21 */
#define IFX_PSI5_RDIOV_RDI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI22 */
#define IFX_PSI5_RDIOV_RDI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI22 */
#define IFX_PSI5_RDIOV_RDI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI22 */
#define IFX_PSI5_RDIOV_RDI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI23 */
#define IFX_PSI5_RDIOV_RDI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI23 */
#define IFX_PSI5_RDIOV_RDI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI23 */
#define IFX_PSI5_RDIOV_RDI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI24 */
#define IFX_PSI5_RDIOV_RDI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI24 */
#define IFX_PSI5_RDIOV_RDI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI24 */
#define IFX_PSI5_RDIOV_RDI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI25 */
#define IFX_PSI5_RDIOV_RDI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI25 */
#define IFX_PSI5_RDIOV_RDI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI25 */
#define IFX_PSI5_RDIOV_RDI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI26 */
#define IFX_PSI5_RDIOV_RDI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI26 */
#define IFX_PSI5_RDIOV_RDI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI26 */
#define IFX_PSI5_RDIOV_RDI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI27 */
#define IFX_PSI5_RDIOV_RDI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI27 */
#define IFX_PSI5_RDIOV_RDI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI27 */
#define IFX_PSI5_RDIOV_RDI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI28 */
#define IFX_PSI5_RDIOV_RDI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI28 */
#define IFX_PSI5_RDIOV_RDI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI28 */
#define IFX_PSI5_RDIOV_RDI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI29 */
#define IFX_PSI5_RDIOV_RDI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI29 */
#define IFX_PSI5_RDIOV_RDI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI29 */
#define IFX_PSI5_RDIOV_RDI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_LEN (1)

