keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI10 */
#define IFX_PSI5_RSICLR_RSI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI11 */
#define IFX_PSI5_RSICLR_RSI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI11 */
#define IFX_PSI5_RSICLR_RSI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI11 */
#define IFX_PSI5_RSICLR_RSI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI12 */
#define IFX_PSI5_RSICLR_RSI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI12 */
#define IFX_PSI5_RSICLR_RSI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI12 */
#define IFX_PSI5_RSICLR_RSI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI13 */
#define IFX_PSI5_RSICLR_RSI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI13 */
#define IFX_PSI5_RSICLR_RSI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI13 */
#define IFX_PSI5_RSICLR_RSI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI14 */
#define IFX_PSI5_RSICLR_RSI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI14 */
#define IFX_PSI5_RSICLR_RSI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI14 */
#define IFX_PSI5_RSICLR_RSI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI15 */
#define IFX_PSI5_RSICLR_RSI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI15 */
#define IFX_PSI5_RSICLR_RSI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI15 */
#define IFX_PSI5_RSICLR_RSI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI16 */
#define IFX_PSI5_RSICLR_RSI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI16 */
#define IFX_PSI5_RSICLR_RSI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI16 */
#define IFX_PSI5_RSICLR_RSI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI17 */
#define IFX_PSI5_RSICLR_RSI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI17 */
#define IFX_PSI5_RSICLR_RSI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI17 */
#define IFX_PSI5_RSICLR_RSI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI18 */
#define IFX_PSI5_RSICLR_RSI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI18 */
#define IFX_PSI5_RSICLR_RSI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI18 */
#define IFX_PSI5_RSICLR_RSI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI19 */
#define IFX_PSI5_RSICLR_RSI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI19 */
#define IFX_PSI5_RSICLR_RSI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI19 */
#define IFX_PSI5_RSICLR_RSI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI1 */
#define IFX_PSI5_RSICLR_RSI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI1 */
#define IFX_PSI5_RSICLR_RSI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI1 */
#define IFX_PSI5_RSICLR_RSI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI20 */
#define IFX_PSI5_RSICLR_RSI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI20 */
#define IFX_PSI5_RSICLR_RSI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI20 */
#define IFX_PSI5_RSICLR_RSI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI21 */
#define IFX_PSI5_RSICLR_RSI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI21 */
#define IFX_PSI5_RSICLR_RSI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI21 */
#define IFX_PSI5_RSICLR_RSI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI22 */
#define IFX_PSI5_RSICLR_RSI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI22 */
#define IFX_PSI5_RSICLR_RSI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI22 */
#define IFX_PSI5_RSICLR_RSI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI23 */
#define IFX_PSI5_RSICLR_RSI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI23 */
#define IFX_PSI5_RSICLR_RSI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI23 */
#define IFX_PSI5_RSICLR_RSI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI24 */
#define IFX_PSI5_RSICLR_RSI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI24 */
#define IFX_PSI5_RSICLR_RSI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI24 */
#define IFX_PSI5_RSICLR_RSI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI25 */
#define IFX_PSI5_RSICLR_RSI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI25 */
#define IFX_PSI5_RSICLR_RSI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI25 */
#define IFX_PSI5_RSICLR_RSI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI26 */
#define IFX_PSI5_RSICLR_RSI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI26 */
#define IFX_PSI5_RSICLR_RSI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI26 */
#define IFX_PSI5_RSICLR_RSI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI27 */
#define IFX_PSI5_RSICLR_RSI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI27 */
#define IFX_PSI5_RSICLR_RSI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI27 */
#define IFX_PSI5_RSICLR_RSI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI28 */
#define IFX_PSI5_RSICLR_RSI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI28 */
#define IFX_PSI5_RSICLR_RSI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI28 */
#define IFX_PSI5_RSICLR_RSI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI29 */
#define IFX_PSI5_RSICLR_RSI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI29 */
#define IFX_PSI5_RSICLR_RSI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI29 */
#define IFX_PSI5_RSICLR_RSI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI2 */
#define IFX_PSI5_RSICLR_RSI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI2 */
#define IFX_PSI5_RSICLR_RSI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI2 */
#define IFX_PSI5_RSICLR_RSI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI30 */
#define IFX_PSI5_RSICLR_RSI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI30 */
#define IFX_PSI5_RSICLR_RSI30_MSK (0x1)

