keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI21 */
#define IFX_PSI5_RSIOV_RSI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI21 */
#define IFX_PSI5_RSIOV_RSI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI21 */
#define IFX_PSI5_RSIOV_RSI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI22 */
#define IFX_PSI5_RSIOV_RSI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI22 */
#define IFX_PSI5_RSIOV_RSI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI22 */
#define IFX_PSI5_RSIOV_RSI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI23 */
#define IFX_PSI5_RSIOV_RSI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI23 */
#define IFX_PSI5_RSIOV_RSI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI23 */
#define IFX_PSI5_RSIOV_RSI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI24 */
#define IFX_PSI5_RSIOV_RSI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI24 */
#define IFX_PSI5_RSIOV_RSI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI24 */
#define IFX_PSI5_RSIOV_RSI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI25 */
#define IFX_PSI5_RSIOV_RSI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI25 */
#define IFX_PSI5_RSIOV_RSI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI25 */
#define IFX_PSI5_RSIOV_RSI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI26 */
#define IFX_PSI5_RSIOV_RSI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI26 */
#define IFX_PSI5_RSIOV_RSI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI26 */
#define IFX_PSI5_RSIOV_RSI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI27 */
#define IFX_PSI5_RSIOV_RSI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI27 */
#define IFX_PSI5_RSIOV_RSI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI27 */
#define IFX_PSI5_RSIOV_RSI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI28 */
#define IFX_PSI5_RSIOV_RSI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI28 */
#define IFX_PSI5_RSIOV_RSI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI28 */
#define IFX_PSI5_RSIOV_RSI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI29 */
#define IFX_PSI5_RSIOV_RSI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI29 */
#define IFX_PSI5_RSIOV_RSI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI29 */
#define IFX_PSI5_RSIOV_RSI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI2 */
#define IFX_PSI5_RSIOV_RSI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI2 */
#define IFX_PSI5_RSIOV_RSI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI2 */
#define IFX_PSI5_RSIOV_RSI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI30 */
#define IFX_PSI5_RSIOV_RSI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI30 */
#define IFX_PSI5_RSIOV_RSI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI30 */
#define IFX_PSI5_RSIOV_RSI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI31 */
#define IFX_PSI5_RSIOV_RSI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI31 */
#define IFX_PSI5_RSIOV_RSI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI31 */
#define IFX_PSI5_RSIOV_RSI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI3 */
#define IFX_PSI5_RSIOV_RSI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI3 */
#define IFX_PSI5_RSIOV_RSI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI3 */
#define IFX_PSI5_RSIOV_RSI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI4 */
#define IFX_PSI5_RSIOV_RSI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI4 */
#define IFX_PSI5_RSIOV_RSI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI4 */
#define IFX_PSI5_RSIOV_RSI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI5 */
#define IFX_PSI5_RSIOV_RSI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI5 */
#define IFX_PSI5_RSIOV_RSI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI5 */
#define IFX_PSI5_RSIOV_RSI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI6 */
#define IFX_PSI5_RSIOV_RSI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI6 */
#define IFX_PSI5_RSIOV_RSI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI6 */
#define IFX_PSI5_RSIOV_RSI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI7 */
#define IFX_PSI5_RSIOV_RSI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI7 */
#define IFX_PSI5_RSIOV_RSI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI7 */
#define IFX_PSI5_RSIOV_RSI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI8 */
#define IFX_PSI5_RSIOV_RSI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI8 */
#define IFX_PSI5_RSIOV_RSI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI8 */
#define IFX_PSI5_RSIOV_RSI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI9 */
#define IFX_PSI5_RSIOV_RSI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI9 */
#define IFX_PSI5_RSIOV_RSI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI9 */
#define IFX_PSI5_RSIOV_RSI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_RSISET_Bits.RSI0 */
#define IFX_PSI5_RSISET_RSI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSISET_Bits.RSI0 */
#define IFX_PSI5_RSISET_RSI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSISET_Bits.RSI0 */
#define IFX_PSI5_RSISET_RSI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_RSISET_Bits.RSI10 */
#define IFX_PSI5_RSISET_RSI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSISET_Bits.RSI10 */
#define IFX_PSI5_RSISET_RSI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSISET_Bits.RSI10 */
#define IFX_PSI5_RSISET_RSI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_RSISET_Bits.RSI11 */
#define IFX_PSI5_RSISET_RSI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSISET_Bits.RSI11 */
#define IFX_PSI5_RSISET_RSI11_MSK (0x1)

