keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI16 */
#define IFX_PSI5_TEIOV_TEI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI16 */
#define IFX_PSI5_TEIOV_TEI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI16 */
#define IFX_PSI5_TEIOV_TEI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI17 */
#define IFX_PSI5_TEIOV_TEI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI17 */
#define IFX_PSI5_TEIOV_TEI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI17 */
#define IFX_PSI5_TEIOV_TEI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI18 */
#define IFX_PSI5_TEIOV_TEI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI18 */
#define IFX_PSI5_TEIOV_TEI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI18 */
#define IFX_PSI5_TEIOV_TEI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI19 */
#define IFX_PSI5_TEIOV_TEI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI19 */
#define IFX_PSI5_TEIOV_TEI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI19 */
#define IFX_PSI5_TEIOV_TEI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI1 */
#define IFX_PSI5_TEIOV_TEI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI1 */
#define IFX_PSI5_TEIOV_TEI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI1 */
#define IFX_PSI5_TEIOV_TEI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI20 */
#define IFX_PSI5_TEIOV_TEI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI20 */
#define IFX_PSI5_TEIOV_TEI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI20 */
#define IFX_PSI5_TEIOV_TEI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI21 */
#define IFX_PSI5_TEIOV_TEI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI21 */
#define IFX_PSI5_TEIOV_TEI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI21 */
#define IFX_PSI5_TEIOV_TEI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI22 */
#define IFX_PSI5_TEIOV_TEI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI22 */
#define IFX_PSI5_TEIOV_TEI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI22 */
#define IFX_PSI5_TEIOV_TEI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI23 */
#define IFX_PSI5_TEIOV_TEI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI23 */
#define IFX_PSI5_TEIOV_TEI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI23 */
#define IFX_PSI5_TEIOV_TEI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI24 */
#define IFX_PSI5_TEIOV_TEI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI24 */
#define IFX_PSI5_TEIOV_TEI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI24 */
#define IFX_PSI5_TEIOV_TEI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI25 */
#define IFX_PSI5_TEIOV_TEI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI25 */
#define IFX_PSI5_TEIOV_TEI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI25 */
#define IFX_PSI5_TEIOV_TEI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI26 */
#define IFX_PSI5_TEIOV_TEI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI26 */
#define IFX_PSI5_TEIOV_TEI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI26 */
#define IFX_PSI5_TEIOV_TEI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI27 */
#define IFX_PSI5_TEIOV_TEI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI27 */
#define IFX_PSI5_TEIOV_TEI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI27 */
#define IFX_PSI5_TEIOV_TEI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI28 */
#define IFX_PSI5_TEIOV_TEI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI28 */
#define IFX_PSI5_TEIOV_TEI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI28 */
#define IFX_PSI5_TEIOV_TEI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI29 */
#define IFX_PSI5_TEIOV_TEI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI29 */
#define IFX_PSI5_TEIOV_TEI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI29 */
#define IFX_PSI5_TEIOV_TEI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI2 */
#define IFX_PSI5_TEIOV_TEI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI2 */
#define IFX_PSI5_TEIOV_TEI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI2 */
#define IFX_PSI5_TEIOV_TEI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI30 */
#define IFX_PSI5_TEIOV_TEI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI30 */
#define IFX_PSI5_TEIOV_TEI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI30 */
#define IFX_PSI5_TEIOV_TEI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI31 */
#define IFX_PSI5_TEIOV_TEI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI31 */
#define IFX_PSI5_TEIOV_TEI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI31 */
#define IFX_PSI5_TEIOV_TEI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI3 */
#define IFX_PSI5_TEIOV_TEI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI3 */
#define IFX_PSI5_TEIOV_TEI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI3 */
#define IFX_PSI5_TEIOV_TEI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI4 */
#define IFX_PSI5_TEIOV_TEI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI4 */
#define IFX_PSI5_TEIOV_TEI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI4 */
#define IFX_PSI5_TEIOV_TEI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI5 */
#define IFX_PSI5_TEIOV_TEI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI5 */
#define IFX_PSI5_TEIOV_TEI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI5 */
#define IFX_PSI5_TEIOV_TEI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI6 */
#define IFX_PSI5_TEIOV_TEI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI6 */
#define IFX_PSI5_TEIOV_TEI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI6 */
#define IFX_PSI5_TEIOV_TEI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI7 */
#define IFX_PSI5_TEIOV_TEI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI7 */
#define IFX_PSI5_TEIOV_TEI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI7 */
#define IFX_PSI5_TEIOV_TEI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI8 */
#define IFX_PSI5_TEIOV_TEI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEIOV_Bits.TEI8 */
#define IFX_PSI5_TEIOV_TEI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEIOV_Bits.TEI8 */
#define IFX_PSI5_TEIOV_TEI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_TEIOV_Bits.TEI9 */
#define IFX_PSI5_TEIOV_TEI9_LEN (1)

